//[] +1 * & 使用测试
#include <stdio.h>

int main(void)
{
    int mar[3][4] = {
        {11, 14, 17, 19},
        {21, 24, 27, 29},
        {31, 34, 37, 39},
    };

    // + 优先级低于这两位 但是有()修饰
    // *优先级相当高 多个同理
    // []又比*高

    printf("%9s 的值是: %4d \n","mar[0][0]",(mar[0][0]));
    // printf("%9s 的值是: %4d \n","**mar+1",(**mar+1));
    // printf("%9s 的值是: %4d \n","**(mar+1)",(**(mar+1)));
    // printf("%9s 的值是: %4d \n","(**mar)+1",((**mar)+1));
    printf("%9s 的值是: %4d \n","*mar[1]",(*mar[1]));
    printf("%9s 的值是: %4d \n","*(mar[1]+1)",(*(mar[1]+1)));
    printf("%9s 的值是: %4d \n","*(mar+1)[2]",(*(mar+1)[2]));

    return 0;
}